app/controllers/upload_videos_controller.rb

  def index
    @upload_videos = Video.all
---
SELECT `videos`.* FROM `videos`

  def create
    @upload_video = Video.new(upload_video_params)

    respond_to do |format|
      if @upload_video.save
---
INSERT INTO `videos` (`title`, `video_url`, `poster_url`, `tags`, `video_desc`, `created_at`, `updated_at`) VALUES ('abc', 'uploads/3461b6e0-5df2-4f5b-93a1-7878a1bebe90/video', 'uploads/3461b6e0-5df2-4f5b-93a1-7878a1bebe90/poster', '', '', '2016-06-17 20:26:13', '2016-06-17 20:26:13')