app/controllers/videos_controller.rb

  def show
    @video[:video_url] = "#@@CDN_DNS" + @video[:video_url]
    @video[:poster_url] = "#@@CDN_DNS" + @video[:poster_url]
    @uploader = User.find(@video[:uploader_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

    def set_video
      @video = Video.where(id: params[:id]).first
---
SELECT  `videos`.* FROM `videos` WHERE `videos`.`id` = 56  ORDER BY `videos`.`id` ASC LIMIT 1